
# Cруктура истории
# Нападение на ваш корабль +
# Выбор действия +

# Вас выкинули за борт, вы на берегу +

# Встреча с разбойниками
# Выбор действия

# Хижина охотника, вы проситесь внутрь, проверка навыков
# 1) Проверка навыков пройдена, вы приняты в ученики к охотнику
    # (Повышение навыка сила и красноречие)
    # Очередная тренировка, на ней вы ...
    # Вас послали в город, чтобы вы продали меха, и купили стали
    # (Выбор, согласно навыкам)
    # В городе охотник, чтобы заработать денег учавствует в кулачном бою (выигрывает)
    # На границе города вас останавливает стража т.к. (в зависимости от выбора)
    # К вам подъезжает дворянин (он видел бой), хочет нанять вашего наставника и вас на службу
    # Шло время, король Франции объявил войну вашему государству
    # Зимой к вам приходит стража и говорит, что эту землю выкипил тот самый дворянин, и просит вас платить дань
    # Охотник отказывается
    # Нападение на следующую ночь (Выбор тактики)
    # Смерть охотника
    # Он просит вас идти на службу к королю, говорит, что только там вы сможете отточить свои боевые навыки до идеала


# 2) Проверка не пройдена, вы приходите в город, находите там торговца, мастера кулачных боев и глашатого
    # Выбор к кому идти
    # Просто повышение соответствующего стата и прошел месяц, вы были подсобником
    # Король Франции объявил войну вашему государству
    #Выбор, остаться с (наставником) или пойти в стражу

#Если пошел в стражу, то попал на битву при реке Нави
    # Либо смерть при нехватке навыков, либо остался среди немногих выживших и получил титул сотника
    # Вам приказано подготовить вашу сотню к следующей битве
    # Вы спрашиваете у других сотников, как вам следует производить подготовку (добавляется навык Управление)
    # На следующей битве в зависимости от того, как вы подготовили вашу сотню битва либо выиграна (вас причисляют к свите короля), либо проиграна (вы в плену или мертвы [random])
    # 2.1.1) [Плен] - вас пытают около целую неделю, затем замок в котором вас держали захватывают союзные войска и освобождают вас
    # 2.1.2) [Мертвы]
    # 2.1.3) [Свита короля] - вас берется тренировать Бёдвар (глава свиты короля) [повышение навыка управление]

# Ваша следующая задача - захватить замок Дребуг, что на границе с Франками, дабы укрепить тылы союзных войск и дать шанс для отступления
# Проверка навыка управление, возможность вызова командующего армией на поединок (при красноречии, или явном преимуществе)
# Либо смерть, либо Титул военначальника
# Можно уйти на покой или сразиться в решающей схватке с королем Франции (вам выдают армию на обучение, вы становитесь командиром свиты, т.к. Бёдвар умер при штурме замка, в котором вас пытали (из свиты осталось только трое, не включая вас))
    # 3.1) Проверка навыка управление (победа или смерть)
        # 3.1.1) [Победа] Вы признанный герой Франков {Конец}
    # 3.2) Вы получили титул дворянина, земляной надел и слуг в размере 20 человек
        # Конец
# Цель игры [месть, богатство, власть]